addons/l10n_tr_nilvera_einvoice/tests/test_files/fetching/invoice.xml

<?xml version='1.0' encoding='UTF-8'?>
<Invoice xmlns="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2" xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2">
  <cbc:UBLVersionID>2.1</cbc:UBLVersionID>
  <cbc:CustomizationID>TR1.2</cbc:CustomizationID>
  <cbc:ProfileID>TEMELFATURA</cbc:ProfileID>
  <cbc:ID>INV2025000000001</cbc:ID>
  <cbc:CopyIndicator>false</cbc:CopyIndicator>
  <cbc:UUID>invoice_uuid</cbc:UUID>
  <cbc:IssueDate>2025-03-05</cbc:IssueDate>
  <cbc:InvoiceTypeCode>SATIS</cbc:InvoiceTypeCode>
  <cbc:Note>YALNIZ : YÜZONBEŞ TRY SIFIR KURUS</cbc:Note>
  <cbc:Note>YALNIZ : YÜZONBEŞ USD SIFIR CENTS</cbc:Note>
  <cbc:Note>KUR : 1.000000 TL</cbc:Note>
  <cbc:DocumentCurrencyCode>USD</cbc:DocumentCurrencyCode>
  <cbc:LineCountNumeric>3</cbc:LineCountNumeric>
  <cac:OrderReference>
    <cbc:ID>INV/2025/00001</cbc:ID>
    <cbc:IssueDate>2025-03-05</cbc:IssueDate>
  </cac:OrderReference>
  <cac:AccountingSupplierParty>
    <cac:Party>
      <cac:PartyIdentification>
        <cbc:ID schemeID="VKN">3297552117</cbc:ID>
      </cac:PartyIdentification>
      <cac:PartyName>
        <cbc:Name>company_1_data</cbc:Name>
      </cac:PartyName>
      <cac:PostalAddress>
        <cbc:StreetName>3281. Cadde</cbc:StreetName>
        <cbc:CitySubdivisionName>İç Anadolu Bölgesi</cbc:CitySubdivisionName>
        <cbc:CityName>Düzce</cbc:CityName>
        <cbc:PostalZone>06810</cbc:PostalZone>
        <cac:Country>
          <cbc:IdentificationCode>US</cbc:IdentificationCode>
          <cbc:Name>United States</cbc:Name>
        </cac:Country>
      </cac:PostalAddress>
      <cac:PartyTaxScheme>
        <cbc:RegistrationName>company_1_data</cbc:RegistrationName>
        <cbc:CompanyID>3297552117</cbc:CompanyID>
        <cac:TaxScheme>
          <cbc:Name>Tax Office</cbc:Name>
        </cac:TaxScheme>
      </cac:PartyTaxScheme>
      <cac:PartyLegalEntity>
        <cbc:RegistrationName>company_1_data</cbc:RegistrationName>
        <cbc:CompanyID>3297552117</cbc:CompanyID>
      </cac:PartyLegalEntity>
      <cac:Contact>
        <cbc:ID>___ignore___</cbc:ID>
        <cbc:Name>company_1_data</cbc:Name>
      </cac:Contact>
    </cac:Party>
  </cac:AccountingSupplierParty>
  <cac:AccountingCustomerParty>
    <cac:Party>
      <cac:PartyIdentification>
        <cbc:ID schemeID="TCKN">17291716060</cbc:ID>
      </cac:PartyIdentification>
      <cac:PartyName>
        <cbc:Name>Salt Bae LLC</cbc:Name>
      </cac:PartyName>
      <cac:PostalAddress>
        <cbc:StreetName>Gökhane Sokak No:1</cbc:StreetName>
        <cbc:CitySubdivisionName>Sincan/Ankara</cbc:CitySubdivisionName>
        <cbc:CityName>Ankara</cbc:CityName>
        <cbc:PostalZone>06934</cbc:PostalZone>
        <cac:Country>
          <cbc:IdentificationCode>TR</cbc:IdentificationCode>
          <cbc:Name>Türkiye</cbc:Name>
        </cac:Country>
      </cac:PostalAddress>
      <cac:PartyTaxScheme>
        <cbc:RegistrationName>Salt Bae LLC</cbc:RegistrationName>
        <cbc:CompanyID>17291716060</cbc:CompanyID>
        <cac:TaxScheme>
          <cbc:Name>Salt Bae Tax Office</cbc:Name>
        </cac:TaxScheme>
      </cac:PartyTaxScheme>
      <cac:PartyLegalEntity>
        <cbc:RegistrationName>Salt Bae LLC</cbc:RegistrationName>
        <cbc:CompanyID>17291716060</cbc:CompanyID>
      </cac:PartyLegalEntity>
      <cac:Contact>
        <cbc:ID>___ignore___</cbc:ID>
        <cbc:Name>Salt Bae LLC</cbc:Name>
      </cac:Contact>
      <cac:Person>
        <cbc:FirstName>Salt</cbc:FirstName>
        <cbc:FamilyName>Bae LLC</cbc:FamilyName>
      </cac:Person>
    </cac:Party>
  </cac:AccountingCustomerParty>
  <cac:PaymentMeans>
    <cbc:PaymentMeansCode name="credit transfer">30</cbc:PaymentMeansCode>
    <cbc:PaymentDueDate>2025-03-05</cbc:PaymentDueDate>
  </cac:PaymentMeans>
  <cac:TaxTotal>
    <cbc:TaxAmount currencyID="USD">15.00</cbc:TaxAmount>
    <cac:TaxSubtotal>
      <cbc:TaxableAmount currencyID="USD">100.00</cbc:TaxableAmount>
      <cbc:TaxAmount currencyID="USD">15.00</cbc:TaxAmount>
      <cbc:Percent>15.0</cbc:Percent>
      <cac:TaxCategory>
        <cac:TaxScheme>
          <cbc:Name>Gerçek Usulde KDV</cbc:Name>
          <cbc:TaxTypeCode>0015</cbc:TaxTypeCode>
        </cac:TaxScheme>
      </cac:TaxCategory>
    </cac:TaxSubtotal>
  </cac:TaxTotal>
  <cac:LegalMonetaryTotal>
    <cbc:LineExtensionAmount currencyID="USD">100.00</cbc:LineExtensionAmount>
    <cbc:TaxExclusiveAmount currencyID="USD">100.00</cbc:TaxExclusiveAmount>
    <cbc:TaxInclusiveAmount currencyID="USD">115.00</cbc:TaxInclusiveAmount>
    <cbc:AllowanceTotalAmount currencyID="USD">0.00</cbc:AllowanceTotalAmount>
    <cbc:PayableAmount currencyID="USD">115.00</cbc:PayableAmount>
  </cac:LegalMonetaryTotal>
  <cac:InvoiceLine>
    <cbc:ID>1</cbc:ID>
    <cbc:InvoicedQuantity unitCode="C62">1.0</cbc:InvoicedQuantity>
    <cbc:LineExtensionAmount currencyID="USD">100.00</cbc:LineExtensionAmount>
    <cac:TaxTotal>
      <cbc:TaxAmount currencyID="USD">15.00</cbc:TaxAmount>
      <cac:TaxSubtotal>
        <cbc:TaxableAmount currencyID="USD">100.00</cbc:TaxableAmount>
        <cbc:TaxAmount currencyID="USD">15.00</cbc:TaxAmount>
        <cbc:Percent>15.0</cbc:Percent>
        <cac:TaxCategory>
          <cac:TaxScheme>
            <cbc:Name>Gerçek Usulde KDV</cbc:Name>
            <cbc:TaxTypeCode>0015</cbc:TaxTypeCode>
          </cac:TaxScheme>
        </cac:TaxCategory>
      </cac:TaxSubtotal>
    </cac:TaxTotal>
    <cac:Item>
      <cbc:Description>product_a</cbc:Description>
      <cbc:Name>product_a</cbc:Name>
    </cac:Item>
    <cac:Price>
      <cbc:PriceAmount currencyID="USD">100.0</cbc:PriceAmount>
    </cac:Price>
  </cac:InvoiceLine>
</Invoice>
